trade_exp/src/Enums/ВидЗаявкиНаМонтаж/ВидЗаявкиНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bd41e4fa-d1a6-4738-a860-96b26d80b814">
  <name>ВидЗаявкиНаМонтаж</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a7b9f8e9-615e-4bf3-b9e2-1d2b37d3c181">
    <name>УстановкаДверей</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c3b2808-1272-49c9-a252-d01a839c9cdf">
    <name>МонтажДушевых</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1c789fec-de7c-4022-9637-42ab4fd6bf48">
    <name>МонтажТеплиц</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ee30ec56-627d-4e91-99b0-2d8151a4ac8a">
    <name>МонтажВодонагревателей</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7685f973-a8d3-4c8e-9ba0-dc1223bc0964">
    <name>МонтажРадиаторовОтопления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9ab3c795-dc42-4f7a-bb72-54c21bf15ebc">
    <name>УстановкаСанфаянса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="38bf51a4-98f6-41db-a0dc-4bbb2dc28452">
    <name>УстановкаГазовыхКотлов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ЗамерЗаявкиНаМонтаж/ЗамерЗаявкиНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="dcf130f3-488f-47ca-a189-abcd3094e2a8">
  <name>ЗамерЗаявкиНаМонтаж</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="576e6011-c927-45e5-bdea-e0cf57962489">
    <name>ЗамерНеНужен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="94ebb910-f682-4df1-9e49-572410b9a782">
    <name>НуженЗамер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5ac3ac0e-f44a-4d4e-9e12-aaae22dfaa26">
    <name>НуженЗамерИМонтаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5a0401f8-2fe4-41b6-aaf3-e45ce4d95e0b">
    <name>ЗамерБылПроизведенеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonForms/ФормаЗаявкаНаМонтаж/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Подразделение") Тогда
       Подразделение = Параметры.Подразделение;
    КонецЕсли;
   
   Если Параметры.Свойство("Партнер") Тогда
	   ФИОКлиента = Параметры.Партнер.Наименование;
	   ТелефонКлиента = АЛьтерраОбщегоНазначения.ПолучитьТелефонПартнера(Параметры.Партнер); 
   КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Спр_СоздатьБППослеНаСервере()

	ПустаяСтрокаОтвета = "";
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Сообщить("Не заполнено подразделение!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;      
	
	Если НЕ ЗначениеЗаполнено(ФИОКлиента) Тогда
		Сообщить("Не заполнено ФИО клиента!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидРабот) Тогда
		Сообщить("Не заполнен вид работ!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Товары) Тогда
		Сообщить("Не заполнены товары!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаМонтажа) Тогда
		Сообщить("Не заполнена дата монтажа!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресКлиента) Тогда
		Сообщить("Не заполнен адрес клиента!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;   
	
	Если НЕ ЗначениеЗаполнено(НуженЗамер) Тогда
		Сообщить("Не заполнена информация по замеру!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;



	
	КодЭлементаПроцесса = Строка(ТекущаяДата());

	АвторЗаписи = АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя();

	Если Не ЗначениеЗаполнено(АвторЗаписи) Тогда
		Сообщить("Текущий пользователь не найден в базе данных битрикса!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	 
	СтруктураД  = Новый Структура();
	
	СтруктураД.Вставить("NAME", Строка(ВидРабот) + " " + Строка(ФИОКлиента));
	
	ПодразделениеНаименование = Подразделение.Наименование; 
	
	Если СтрНайти(ПодразделениеНаименование,"Филиал Барнаул",,,) > 0 Тогда 
		ИдПодразделения = "5390";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Филиал Выбор",,,) > 0 Тогда 
		ИдПодразделения = "5392";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Филиал Бийск",,,) > 0 Тогда
		ИдПодразделения = "5391";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Центральный",,,) > 0 Тогда
		ИдПодразделения = "5389";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"МДП Бийск",,,) > 0 Тогда
		ИдПодразделения = "5394"; 
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"МД",,,) > 0 Тогда
		ИдПодразделения = "5393";
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Контактный",,,) > 0 Тогда
		ИдПодразделения = "5395";  
	ИначеЕсли СтрНайти(ПодразделениеНаименование,"Филиал Майма",,,) > 0 Тогда
		ИдПодразделения = "26485"; 
	Иначе
		ИдПодразделения = ""; 
	КонецЕсли;                  
	
    Если ИдПодразделения <> "" ТОгда 
		СтруктураД.Вставить("PROPERTY_1368", ИдПодразделения);
	Иначе
		Сообщить("Для обязательного поля в значении " + Строка(Подразделение) + " не задан идентификатор Битрикс");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;                
	
	Если ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.УстановкаДверей Тогда 
		ИдВидРабот = "1226"; 
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажДушевых Тогда 
		ИдВидРабот = "1227";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажТеплиц Тогда 
		ИдВидРабот = "1228";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажВодонагревателей Тогда 
		ИдВидРабот = "1330";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.МонтажРадиаторовОтопления Тогда 
		ИдВидРабот = "1331";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.УстановкаСанфаянса Тогда 
		ИдВидРабот = "1332";
	ИначеЕсли ВидРабот = Перечисления.ВидЗаявкиНаМонтаж.УстановкаГазовыхКотлов Тогда 
		ИдВидРабот = "1348";  
	Иначе
		ИдВидРабот = ""; 
	КонецЕсли;  
	
	Если ИдВидРабот <> "" ТОгда 
		СтруктураД.Вставить("PROPERTY_745", ИдВидРабот);
	Иначе
		Сообщить("Для обязательного поля в значении " + Строка(ВидРабот) + " не задан идентификатор Битрикс");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли; 
	
  	СтруктураД.Вставить("PROPERTY_744", ФИОКлиента);
	СтруктураД.Вставить("PROPERTY_746", Товары);
	СтруктураД.Вставить("PROPERTY_747", ДатаМонтажа);
	СтруктураД.Вставить("PROPERTY_748", ТелефонКлиента);
	СтруктураД.Вставить("PROPERTY_749", АдресКлиента);
	СтруктураД.Вставить("PROPERTY_750", Подрядчик);  
	
	Если НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.ЗамерНеНужен Тогда 
		ИдЗамер = "1273"; 
	ИначеЕсли НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.НуженЗамер Тогда 
		ИдЗамер = "1274";
	ИначеЕсли НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.НуженЗамерИМонтаж Тогда 
		ИдЗамер = "5388";
	ИначеЕсли НуженЗамер = Перечисления.ЗамерЗаявкиНаМонтаж.ЗамерБылПроизведенеРанее Тогда 
		ИдЗамер = "1291";
	Иначе
		ИдЗамер = "1273"; 
	КонецЕсли;  
	
	
	
	СтруктураД.Вставить("PROPERTY_842", ИдЗамер);
	
	
	СтруктураД.Вставить("CREATED_BY", АвторЗаписи);
	 
		
		СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка("lists_socnet", "110", КодЭлементаПроцесса,СтруктураД);
	
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;
	Если СтруктураОтвета.Свойство("Результат") или СтруктураОтвета.Свойство("result") Тогда
		Возврат СтруктураОтвета.result;
	Иначе
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Спр_СоздатьБППосле(Команда)
	
	КодЭлементаСписка = Спр_СоздатьБППослеНаСервере();
	Если Не ПустаяСтрока(КодЭлементаСписка) Тогда
		Сообщить("БП создан!");
	Иначе
		Сообщить("БП не создан!");
	КонецЕсли;

КонецПроцедуры
